[{"ID":"BlackPepperRocky","PRONAME": "Black Pepper Essential Oil","GRAPNAME": "Black Pepper Essential Oil","COST": "34.95","MSRP": "40.00","QTYONHAND": "50","QTYBORDER": "100","DESC": "Black Pepper Essential Oil (Piper nigrum) is also commonly known as Peppercorn. Black Pepper Essential Oil has medium-strength warming, stimulating, and slightly sweet aroma presenting a top-middle fragrance note. Black Pepper Essential Oil is part of our Rocky Mountain Oils Relief and Wellness collections, and also offers a host of other benefits. Apply topically, diluted with a carrier oil, to create a warming, stimulating effect on the skin. This makes Black Pepper great in a massage or in a post-workout compress for achy muscles. Diffuse the oil in any space to refresh the mind and encourage feelings of progression, so you’ll want to get up and get moving.","BRAND": "ROCKY MOUNTAIN OILS"},
{"ID":"BasilRocky","PRONAME": "Basil Essential Oil","GRAPNAME": "Basil Essential Oil","COST": "16.95","MSRP": "20.00","QTYONHAND": "25","QTYBORDER": "150","DESC": "For many of us who are fans of gardening, the refreshing scent of basil is something that many of us have come to admire. As a member of the mint family, basil is believed to have originated from India and areas of China, and it has a rich history throughout the world. Used in embalming and preserving rituals by ancient Egyptians, as well as in traditional Ayurvedic medicines of ancient India, basil is considered one of the oldest and most versatile herbs still in use today. The benefits of Basil Essential Oil are vast. You can diffuse Basil to energize the body and stimulate mental clarity for enhanced alertness. Diffuse or add to an aromatherapy inhaler and breathe in deeply to experience the effects of a calmer mind and clear mental focus before a big test or work meeting. Soothe your nerves and create a more peaceful state of mind in times of hardship by including Basil in your diffuser blend. Commonly used in skin and hair care, Basil offers a wide range of benefits that help to calm minor skin irritations and itchiness associated with a flaky scalp or dry skin. Add a few drops to your favorite carrier oil or shampoo to hydrate and add shine to your locks and promote lustrous hair. Include Basil essential oil in your skincare routine for a brighter and smoother complexion. Experience the soothing properties of Basil by diluting it with a carrier oil and applying topically to tired or achy muscles and joints. With a strong herbal aroma, Basil essential oil presents a middle-top fragrance note that features a spicy, sharp, and almost licorice-like scent that makes for an excellent addition to many diffuser blends. Basil Essential Oil is part of the Rocky Mountain Oils® Relief collection.","BRAND": "ROCKY MOUNTAIN OILS"},
{"ID":"CardamonRocky","PRONAME": "Cardamom Essential Oil","GRAPNAME": "Cardamom Essential Oil","COST": "41.95","MSRP": "43.00","QTYONHAND": "15","QTYBORDER": "50","DESC": "Cardamom Essential Oil (Elettaria cardamomum) is also commonly known as True or Green Cardamom. Cardamom’s warm, spicy-sweet aroma presents a middle fragrance note. One of the oldest known spices, Cardamom Essential Oil is included in the Rocky Mountain Oils Mood and Wellness collections. Use in a diffuser or for direct inhalation. Cardamom is also a great oil to use topically when diluted with your favorite carrier oil. Use in a warm compress, bath, or during a massage. Cardamom Essential Oil invigorates the mind while promoting concentration and mental clarity.","BRAND": "ROCKY MOUNTAIN OILS"},
{"ID":"CedarwoodRocky","PRONAME": "Cedarwood Essential Oil","GRAPNAME": "Cedarwood Essential Oil","COST": "11.95","MSRP": "15.00","QTYONHAND": "65","QTYBORDER": "35","DESC": "Cedarwood Essential Oil (Cedrus atlantica) has a strong warm, camphoraceous, sweet, woody, and balsamic aroma presenting base and middle fragrance notes. Cedarwood Essential Oil is part of the Rocky Mountain Oils Relief, Skin Care, and Energy collections. Add Cedarwood to your skin care regimen. Apply, diluted with your favorite carrier oil, to oily skin and hair. As a scalp and hair tonic, Cedarwood oil may help encourage stronger, shinier hair. Also use the oil to fortify and strengthen emotions while helping to even out the mood.","BRAND": "ROCKY MOUNTAIN OILS"},
{"ID":"CinnamonRocky","PRONAME": "Cinnamon Bark Essential Oil","GRAPNAME": "Cinnamon Bark Essential Oil","COST": "39.95","MSRP": "42.00","QTYONHAND": "45","QTYBORDER": "25","DESC": "Experience the warm and comforting effects of Cinnamon Bark! Although Cinnamon is often thought of in association with the cold, winter months, its essential oil is one you can benefit from all year round. Cinnamon Bark is a highly versatile oil, offering a wide range of benefits that can support better overall health. Its powerful and natural purifying properties makes it great for cleansing the air and supporting your body's immune defenses. Cinnamon Bark can also help boost circulation and calm an upset stomach. When applied topically, its warming sensation makes it a must-have for soothing overworked or sore muscles and joints. With a spicy and warm aroma, Cinnamon is great for comforting the mind and easing feelings of sadness. Not only that, but Cinnamon Bark can help stimulate and boost libido, providing you with a more pleasurable experience. Warning: Cinnamon Bark is a 'hot' oil and can cause skin irritation. Be sure to dilute prior to applying topically.","BRAND": "ROCKY MOUNTAIN OILS"},
{"ID":"BergamotDoterra","PRONAME": "Bergamot","GRAPNAME": "Bergamot","COST": "30.00","MSRP": "40.00","QTYONHAND": "15","QTYBORDER": "55","DESC": "Bergamot is the most delicate of the citrus plants, requiring special climate and soil in order to thrive. Italians have used Bergamot oil for years to reduce feelings of stress and to soothe and rejuvenate skin. In Greece, the unripe fruits are used as sweetmeats, eaten by the spoonful as a dessert or with coffee. Bergamot essential oil is unique among citrus oils due to its ability to be both uplifting and calming, making it ideal to help with anxious and sad feelings. It is also purifying and cleansing for the skin while having a calming effect.","BRAND": "DOTERRA"},
{"ID":"BlueTansyDoterra","PRONAME": "Blue Tansy","GRAPNAME": "Blue Tansy","COST": "85.00","MSRP": "113.33","QTYONHAND": "50","QTYBORDER": "120","DESC": "Blue Tansy, also referred to as Moroccan Tansy, is an annual yellow-flowered Mediterranean plant found in northern Morocco. Chamazulene, a chemical component in Blue Tansy, provides the characteristic indigo color and is recognized for its skin soothing benefits. At the same time, the main chemical component Sabinene helps diminish the appearance of blemishes. When diffused, Blue Tansy provides a sweet aroma to fill any room. It’s perfect for massaging into skin with fractionated coconut oil or lotion after a long day of work or intense exercise.","BRAND": "DOTERRA"},
{"ID":"CassiaDoterra","PRONAME": "Cassia","GRAPNAME": "Cassia","COST": "25.33","MSRP": "19.00","QTYONHAND": "35","QTYBORDER": "25","DESC": "A close relation to Cinnamon, Cassia has a strong, spicy aroma that can be used in small quantities to transform any essential oil blend. Cassia has been used for thousands of years for its many health benefits. It's one of the few essential oils mentioned in the Old Testament, noted for its unmistakable fragrance and calming aromatic properties. Cassia is a 'warming' oil that helps promote a healthy immune function when ingested.* Experimental research suggests that internal use of Cinnamaldehyde, a major constituent of Cassia, may support a healthy gastrointestinal tract.* Cassia is a great oil to diffuse during cold months due to its warming properties and spicy scent. Due to its caustic nature, Cassia should be diluted with doTERRA Fractionated Coconut Oil when applied to the skin and can be very strong when inhaled directly. When diluted and applied topically, Cassia can help soothe the body. Cassia can be used in cooking either as a replacement for cinnamon in pies and breads or by itself in a myriad of entrees and desserts.","BRAND": "DOTERRA"},
{"ID":"CelarySeedDoterra","PRONAME": "Celery Seed","GRAPNAME": "Celery Seed ","COST": "36.00","MSRP": "48.00","QTYONHAND": "35","QTYBORDER": "65","DESC": "Celery was used as early as the 5th century by the Chinese, and is widely used in Indian Ayurvedic practices today. Conventionally grown grocery store celery looks nothing like the celery seen at local farmers’ markets. The celery plant grows up to three feet tall, is bright green, and radiating with life. Celery has a complex, strong, sweet, and spicy aroma. The plant takes two years to fully mature and produce its small fruit, which are tan to brown in color. The seeds are the primary repository for essential oil. Limonene, the dominant constituent, puts Celery Seed oil in the same league as the refreshing citrus peel and fir needle oils. Soothing digestive issues is one of the many benefits of Celery Seed essential oil.* Experimental research suggests that it may soothe muscles and help joint discomfort when taken internally.* The oil creates a calming, relaxing, and positive environment while providing cooling and soothing effects.","BRAND": "DOTERRA"},
{"ID":"CilantroDoterra","PRONAME": "Cilantro","GRAPNAME": "Cilantro ","COST": "26.00","MSRP": "34.67","QTYONHAND": "45","QTYBORDER": "25","DESC": "The culinary uses and additional benefits of Cilantro have been documented for centuries. Internal use of Cilantro promotes healthy digestion and supports healthy immune and nervous system functions. Applied topically, Cilantro is very soothing and cooling to the skin, and it adds a fresh, herbal aroma to any essential oil blend when diffused. Linalool and trans-2-decenal, the two main components of Cilantro, are known to have surface cleansing properties. Cilantro’s culinary uses are endless, adding a flavorful twist to meats, salads, dips, and guacamole.","BRAND": "DOTERRA"},
{"ID":"AmyrisEdens","PRONAME": "Amyris Essential Oil","GRAPNAME": "Amyris Essential Oil","COST": "7.00","MSRP": "9.69","QTYONHAND": "15","QTYBORDER": "150","DESC": "Somehow, there never seem to be enough hours in the day. There is always more to do, more to check off our lists. The value of Amyris essential oil is in its refreshing aroma that lifts away stress and anxiety. It also has many medicinal benefits.mAlso known as West Indian Sandalwood or Indies Sandalwood, Amyris essential oil originates from the West Indies, specifically in Haiti. The soft aroma is reminiscent of resin oils like benzoin and it is often used as a perfume 'fixative' to extend the fragrant life of a blend. True to the nature of base notes in general, it provides grounding and soothing qualities. The essential oil, like many other resin oils, is said to have beneficial properties for the skin. The beauty of Amyris is its refreshing aroma. The essential oil lifts the spirit and helps instill a sense of calm. In the past, Amyris was used in the fragrance industry to mimic Vetiver essential oil and today both aromatherapists and perfumers may substitute it for endangered or scarce species of Sandalwood. The essential oil is derived from a tree that can take up to 30 years to produce oil. The tree grows to a height of 60 feet and bears white flowers that grow into black-bluish fruits. Amyris was used in its native habitat of the Caribbean region for its calming and sensual qualities. Surprisingly, this tree is in the citrus family.","BRAND": "EDENS GARDEN"},
{"ID":"BergamotEdens","PRONAME": "Bergamot Essential Oil","GRAPNAME": "Bergamot Essential Oil","COST": "8.00","MSRP": "9.69","QTYONHAND": "35","QTYBORDER": "15","DESC": "Calming the mind can be an exhaustive exercise. We all have weeks where the days seem so blended and tangled together that unraveling our thoughts feels impossible. When life feels messy, Bergamot essential oil may help relieve scattered thoughts while promoting focus and clarity. Diffusing Bergamot with Lavender before bedtime can lead to sweet dreams and a restful wake. The clean uplifting citrus aroma will brighten your day and enhance feelings of well-being. It is also supportive in natural bug protection preparations. Native to Southeast Asia, Bergamot is cold pressed then vacuum distilled (if bergapten free) from the fruit of an evergreen citrus tree. The fragrant trees also line the Ivory Coast, Morocco, Tunisia and Algeria.  This small inedible fruit, grown prolifically in the Mediterranean climate was named after the town of Bergamo, Italy, where it is said, it was first distilled. It is well known for its use in the perfume and food industries, but don’t confuse it with other commonly named bergamots, such as bee balm (Monarda didyma) or bergamot mint (Mentha citrata).  Many traditional herbal formulas included a variety of citrus fruit peels to enhance digestion. Although the tree bears non-edible green and yellow fruit, the essential oil of the fruit has been used for its soothing aroma within perfumes and confections. Bergamot oil gives the world’s most popular scented, flavored tea — Earl Grey — its heady citrus aroma and flavor.  This lively essential oil is frequently added to perfumes and cosmetics. It is a major component in the original “4711 Cologne” formulated at the beginning of 18th-century Germany.","BRAND": "EDENS GARDEN"},
{"ID":"BloodOrangeEdens","PRONAME": "Blood Orange Essential Oil","GRAPNAME": "Blood Orange Essential Oil","COST": "7.53","MSRP": "8.30","QTYONHAND": "65","QTYBORDER": "55","DESC": "Imagine a warm summer day, laying in soft grass watching clouds float across the sky. It's also the perfect day for a piece of fresh fruit. There is something wonderfully refreshing about biting into an orange and letting the juice fill your taste buds. Even more exciting may be the lesser-known citrus delight: the Blood Orange. It’s complex and multifaceted in a way that extends to its essential oil. Native to Asia, orange trees grow up to 20-30 feet. The trees produce glossy leaves and aromatic white flowers that develop into delicious fruit. The peel of the orange is extracted through a cold-pressed method. Blood Orange is considered a variety of sweet orange and shares the same botanical name. The distinctive dark flesh 'blood' color is due to the plentiful presence of anthocyanins, a family of healthful antioxidant pigments common to many flowers and fruits, but rare in citrus fruits. Blood Orange is valued by aromatherapists for its invigorating and yet calming aroma. This fascinating duality makes it an ideal aroma during stressful days. The essential oil of Blood Orange exhilarates the senses and inspires a positive outlook.","BRAND": "EDENS GARDEN"},
{"ID":"BuddhaWoodEdens","PRONAME": "Buddha Wood Essential Oil","GRAPNAME": "Buddha Wood Essential Oil","COST": "23.50","MSRP": "25.02","QTYONHAND": "85","QTYBORDER": "15","DESC": "Whether or not you are a practitioner of meditation, Buddha Wood essential oil can be transformative in its ability to increase mindfulness and lasting peace. We all have a lot on our minds with everyday to-dos. Allow Buddha Wood to inspire grounding and help you stay in the present moment. Yoga instructors often use Buddha Wood at the beginning or end of a class to diminish stress. Its woody and slightly smoky aroma lends itself to perfume blends with deep, exotic and romantic undertones. Extracted through steam distillation, Buddha Wood is derived from the wood of a small tree found in the drylands of Southern Australia. The bountiful trees are wild harvested. The timber shavings from this small evergreen tree are distilled for nearly 48 hours which produces an oil that blends well with Muhuhu and other wood-derived essential oils. The essential oil is a deep coppery-red brown color. The aroma of Buddha Wood essential oil is subtle and incredibly balanced: woodsy, mossy and light leathery-smoky notes. Some high-end fragrance companies use Buddha Wood in men’s cologne, for its masculine bouquet. It is equally utilized in androgynous blends.","BRAND": "EDENS GARDEN"},
{"ID":"CarawayEdens","PRONAME": "Caraway Essential Oil","GRAPNAME": "Caraway Essential Oil","COST": "6.50","MSRP": "8.30","QTYONHAND": "15","QTYBORDER": "55","DESC": "Often used by naturopathic physicians for its multitude of therapeutic properties, Caraway essential oil can help ease the stress of the body. Caraway’s impressive history as a culinary spice goes back more than 5,000 years. When the Ebers Papyrus was discovered in the 17th Century, it indicated that ancient Egyptians had been recommending Caraway seeds for digestive upsets since 1550 B.C. In Traditional Chinese Medicine, the Caraway seed is used for its warming effects within the human body. It is an official remedy in the British Herbal Pharmacopoeia for a variety of health concerns, especially related to digestive support. Native to Asia and Europe, and naturalized to North America, the Caraway plant grows approximately 2 feet in height and has leaves similar to those of a carrot (they are in the same botanical family). These plants are widely cultivated in Germany, Russia and many Scandinavian countries, where the culinary use is ubiquitous. The German 'BRAND'y 'Kummel' is made from the seeds. The plant’s small white or pink flowers have seeds capsules that burst open when mature. Caraway essential oil is extracted from the seeds through steam distillation. The fruits (seeds), have a pungent, anise-like flavor and aroma that comes from the complex essential oil. While Caraway seeds are frequently used as a spice in breads, cakes, cheese and rolls, the essential oil is used as a fragrance component in soaps, lotions, and perfumes. Caraway is also used as a breath freshener and is a common component in toothpaste and mouthwash products, and has a long history of use in native folk medicine.","BRAND": "EDENS GARDEN"}
]
